In [ ]:
import pandas as pd

In [ ]:
s = pd.Series(range(0, 20))
s

In [ ]:
s = pd.Series([1, 2, 3, 4, 5], index = ['A', 'B', 'C', 'D', 'E'])
s

In [ ]:
data = [[1,444,'Ahmed'],
        [2,555,'Ali'],
        [3,666,'Aisha'],
        [4,777,'Fatima'],
        [5,888,'Omar']
]

df = pd.DataFrame(data, columns=['Index', 'ID', 'Name'])
df

In [ ]:
data = {
    'Index': [1, 2, 3, 4, 5],
    'ID': [444, 555, 666, 777, 888],
    'Name': ['Ahmed', 'Ali', 'Aisha', 'Fatima', 'Omar']
}
df = pd.DataFrame(data)

In [ ]:
data = pd.DataFrame([[1,444,'Ahmed'],
        [2,555,'Ali'],
        [3,666,'Aisha'],
        [4,777,'Fatima'],
        [5,888,'Omar']
])
#display(df)
#cols = ['A', 'B', 'C']
#df.columns = cols
idx = ['Row 1', 'Row 2', 'Row 3', 'Row 4', 'Row 5']
df.index = idx
display(df)

In [ ]:
df['C'].dtypes

In [ ]:
df["B"] = df["B"].astype('category')
df.dtypes

In [ ]:
cols = ['A', 'B', 'C']
df[cols] = df[cols].astype('category')
df.dtypes

In [13]:
df.tail(5)

       Index   ID    Name
Row 1      1  444   Ahmed
Row 2      2  555     Ali
Row 3      3  666   Aisha
Row 4      4  777  Fatima
Row 5      5  888    Omar

In [17]:
df.describe(include= int)

          Index         ID
count  5.000000    5.00000
mean   3.000000  666.00000
std    1.581139  175.50641
min    1.000000  444.00000
25%    2.000000  555.00000
50%    3.000000  666.00000
75%    4.000000  777.00000
max    5.000000  888.00000

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row 1 to Row 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Index   5 non-null      int64
 1   ID      5 non-null      int64
 2   Name    5 non-null      object
dtypes: int64(2), object(1)
memory usage: 332.0+ bytes

In [21]:
df['Name'].nunique()

5

In [22]:
df['Index'].min()

np.int64(1)

In [23]:
df['Name'].value_counts()

Name
Ahmed     1
Ali       1
Aisha     1
Fatima    1
Omar      1
Name: count, dtype: int64

In [24]:
df.values

array([[1, 444, 'Ahmed'],
       [2, 555, 'Ali'],
       [3, 666, 'Aisha'],
       [4, 777, 'Fatima'],
       [5, 888, 'Omar']], dtype=object)

In [25]:
df.replace({'Name': {'Ahmed': 'Amit', 'Ali': 'Amit'}})

       Index   ID    Name
Row 1      1  444    Amit
Row 2      2  555    Amit
Row 3      3  666   Aisha
Row 4      4  777  Fatima
Row 5      5  888    Omar

In [32]:
df.Name.iloc[0:2]

Row 1    Ahmed
Row 2      Ali
Name: Name, dtype: object

In [34]:
new_col = df.Index + df.ID
new_col

Row 1    445
Row 2    557
Row 3    669
Row 4    781
Row 5    893
dtype: int64